k6/results/mixed-1m.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/mixed.js
        output: -

     scenarios: (100.00%) 3 scenarios, 5000 max VUs, 1m0s max duration (incl. graceful stop):
              * rank: 5000.00 iterations/s for 30s (maxVUs: 300-2000, exec: rank, gracefulStop: 30s)
              * top: 5000.00 iterations/s for 30s (maxVUs: 300-2000, exec: top, gracefulStop: 30s)
              * write: 1000.00 iterations/s for 30s (maxVUs: 200-1000, exec: write, gracefulStop: 30s)


running (0m01.0s), 0015/0800 VUs, 10484 complete and 0 interrupted iterations
rank    [   3% ] 0006/0300 VUs  01.0s/30s  5000.00 iters/s
top     [   3% ] 0007/0300 VUs  01.0s/30s  5000.00 iters/s
write   [   3% ] 0002/0200 VUs  01.0s/30s  1000.00 iters/s

running (0m02.0s), 0025/0800 VUs, 21477 complete and 0 interrupted iterations
rank    [   7% ] 0013/0300 VUs  02.0s/30s  5000.00 iters/s
top     [   7% ] 0011/0300 VUs  02.0s/30s  5000.00 iters/s
write   [   7% ] 0001/0200 VUs  02.0s/30s  1000.00 iters/s

running (0m03.0s), 0016/0800 VUs, 32486 complete and 0 interrupted iterations
rank    [  10% ] 0007/0300 VUs  03.0s/30s  5000.00 iters/s
top     [  10% ] 0006/0300 VUs  03.0s/30s  5000.00 iters/s
write   [  10% ] 0002/0200 VUs  03.0s/30s  1000.00 iters/s

running (0m04.0s), 0021/0800 VUs, 43480 complete and 0 interrupted iterations
rank    [  13% ] 0008/0300 VUs  04.0s/30s  5000.00 iters/s
top     [  13% ] 0009/0300 VUs  04.0s/30s  5000.00 iters/s
write   [  13% ] 0002/0200 VUs  04.0s/30s  1000.00 iters/s

running (0m05.0s), 0022/0800 VUs, 54477 complete and 0 interrupted iterations
rank    [  17% ] 0009/0300 VUs  05.0s/30s  5000.00 iters/s
top     [  17% ] 0010/0300 VUs  05.0s/30s  5000.00 iters/s
write   [  17% ] 0002/0200 VUs  05.0s/30s  1000.00 iters/s

running (0m06.0s), 0027/0800 VUs, 65471 complete and 0 interrupted iterations
rank    [  20% ] 0012/0300 VUs  06.0s/30s  5000.00 iters/s
top     [  20% ] 0011/0300 VUs  06.0s/30s  5000.00 iters/s
write   [  20% ] 0004/0200 VUs  06.0s/30s  1000.00 iters/s

running (0m07.0s), 0031/0800 VUs, 76472 complete and 0 interrupted iterations
rank    [  23% ] 0014/0300 VUs  07.0s/30s  5000.00 iters/s
top     [  23% ] 0013/0300 VUs  07.0s/30s  5000.00 iters/s
write   [  23% ] 0002/0200 VUs  07.0s/30s  1000.00 iters/s

running (0m08.0s), 0019/0800 VUs, 87482 complete and 0 interrupted iterations
rank    [  27% ] 0007/0300 VUs  08.0s/30s  5000.00 iters/s
top     [  27% ] 0010/0300 VUs  08.0s/30s  5000.00 iters/s
write   [  27% ] 0002/0200 VUs  08.0s/30s  1000.00 iters/s

running (0m09.0s), 0074/0800 VUs, 98428 complete and 0 interrupted iterations
rank    [  30% ] 0035/0300 VUs  09.0s/30s  5000.00 iters/s
top     [  30% ] 0024/0300 VUs  09.0s/30s  5000.00 iters/s
write   [  30% ] 0014/0200 VUs  09.0s/30s  1000.00 iters/s

running (0m10.0s), 0033/0800 VUs, 109473 complete and 0 interrupted iterations
rank    [  33% ] 0015/0300 VUs  10.0s/30s  5000.00 iters/s
top     [  33% ] 0015/0300 VUs  10.0s/30s  5000.00 iters/s
write   [  33% ] 0003/0200 VUs  10.0s/30s  1000.00 iters/s

running (0m11.0s), 0047/0800 VUs, 120454 complete and 0 interrupted iterations
rank    [  37% ] 0022/0300 VUs  11.0s/30s  5000.00 iters/s
top     [  37% ] 0021/0300 VUs  11.0s/30s  5000.00 iters/s
write   [  37% ] 0004/0200 VUs  11.0s/30s  1000.00 iters/s

running (0m12.0s), 0021/0800 VUs, 131479 complete and 0 interrupted iterations
rank    [  40% ] 0008/0300 VUs  12.0s/30s  5000.00 iters/s
top     [  40% ] 0010/0300 VUs  12.0s/30s  5000.00 iters/s
write   [  40% ] 0003/0200 VUs  12.0s/30s  1000.00 iters/s

running (0m13.0s), 0018/0800 VUs, 142477 complete and 0 interrupted iterations
rank    [  43% ] 0009/0300 VUs  13.0s/30s  5000.00 iters/s
top     [  43% ] 0007/0300 VUs  13.0s/30s  5000.00 iters/s
write   [  43% ] 0002/0200 VUs  13.0s/30s  1000.00 iters/s

running (0m14.0s), 0018/0800 VUs, 153483 complete and 0 interrupted iterations
rank    [  47% ] 0008/0300 VUs  14.0s/30s  5000.00 iters/s
top     [  47% ] 0008/0300 VUs  14.0s/30s  5000.00 iters/s
write   [  47% ] 0002/0200 VUs  14.0s/30s  1000.00 iters/s

running (0m15.0s), 0028/0800 VUs, 164475 complete and 0 interrupted iterations
rank    [  50% ] 0015/0300 VUs  15.0s/30s  5000.00 iters/s
top     [  50% ] 0011/0300 VUs  15.0s/30s  5000.00 iters/s
write   [  50% ] 0003/0200 VUs  15.0s/30s  1000.00 iters/s

running (0m16.0s), 0026/0800 VUs, 175477 complete and 0 interrupted iterations
rank    [  53% ] 0013/0300 VUs  16.0s/30s  5000.00 iters/s
top     [  53% ] 0011/0300 VUs  16.0s/30s  5000.00 iters/s
write   [  53% ] 0002/0200 VUs  16.0s/30s  1000.00 iters/s

running (0m17.0s), 0023/0800 VUs, 186474 complete and 0 interrupted iterations
rank    [  57% ] 0010/0300 VUs  17.0s/30s  5000.00 iters/s
top     [  57% ] 0012/0300 VUs  17.0s/30s  5000.00 iters/s
write   [  57% ] 0002/0200 VUs  17.0s/30s  1000.00 iters/s

running (0m18.0s), 0037/0800 VUs, 197465 complete and 0 interrupted iterations
rank    [  60% ] 0012/0300 VUs  18.0s/30s  5000.00 iters/s
top     [  60% ] 0023/0300 VUs  18.0s/30s  5000.00 iters/s
write   [  60% ] 0002/0200 VUs  18.0s/30s  1000.00 iters/s

running (0m19.0s), 0039/0800 VUs, 208480 complete and 0 interrupted iterations
rank    [  63% ] 0017/0300 VUs  19.0s/30s  5000.00 iters/s
top     [  63% ] 0017/0300 VUs  19.0s/30s  5000.00 iters/s
write   [  63% ] 0004/0200 VUs  19.0s/30s  1000.00 iters/s

running (0m20.0s), 0020/0800 VUs, 219483 complete and 0 interrupted iterations
rank    [  67% ] 0009/0300 VUs  20.0s/30s  5000.00 iters/s
top     [  67% ] 0008/0300 VUs  20.0s/30s  5000.00 iters/s
write   [  67% ] 0003/0200 VUs  20.0s/30s  1000.00 iters/s

running (0m21.0s), 0025/0800 VUs, 230476 complete and 0 interrupted iterations
rank    [  70% ] 0009/0300 VUs  21.0s/30s  5000.00 iters/s
top     [  70% ] 0010/0300 VUs  21.0s/30s  5000.00 iters/s
write   [  70% ] 0003/0200 VUs  21.0s/30s  1000.00 iters/s

running (0m22.0s), 0022/0800 VUs, 241475 complete and 0 interrupted iterations
rank    [  73% ] 0010/0300 VUs  22.0s/30s  5000.00 iters/s
top     [  73% ] 0010/0300 VUs  22.0s/30s  5000.00 iters/s
write   [  73% ] 0002/0200 VUs  22.0s/30s  1000.00 iters/s

running (0m23.0s), 0046/0800 VUs, 252455 complete and 0 interrupted iterations
rank    [  77% ] 0019/0300 VUs  23.0s/30s  5000.00 iters/s
top     [  77% ] 0023/0300 VUs  23.0s/30s  5000.00 iters/s
write   [  77% ] 0004/0200 VUs  23.0s/30s  1000.00 iters/s

running (0m24.0s), 0021/0800 VUs, 263479 complete and 0 interrupted iterations
rank    [  80% ] 0009/0300 VUs  24.0s/30s  5000.00 iters/s
top     [  80% ] 0010/0300 VUs  24.0s/30s  5000.00 iters/s
write   [  80% ] 0002/0200 VUs  24.0s/30s  1000.00 iters/s

running (0m25.0s), 0042/0800 VUs, 274468 complete and 0 interrupted iterations
rank    [  83% ] 0020/0300 VUs  25.0s/30s  5000.00 iters/s
top     [  83% ] 0020/0300 VUs  25.0s/30s  5000.00 iters/s
write   [  83% ] 0004/0200 VUs  25.0s/30s  1000.00 iters/s

running (0m26.0s), 0019/0800 VUs, 285479 complete and 0 interrupted iterations
rank    [  87% ] 0009/0300 VUs  26.0s/30s  5000.00 iters/s
top     [  87% ] 0008/0300 VUs  26.0s/30s  5000.00 iters/s
write   [  87% ] 0002/0200 VUs  26.0s/30s  1000.00 iters/s

running (0m27.0s), 0016/0800 VUs, 296482 complete and 0 interrupted iterations
rank    [  90% ] 0007/0300 VUs  27.0s/30s  5000.00 iters/s
top     [  90% ] 0007/0300 VUs  27.0s/30s  5000.00 iters/s
write   [  90% ] 0002/0200 VUs  27.0s/30s  1000.00 iters/s

running (0m28.0s), 0019/0800 VUs, 307480 complete and 0 interrupted iterations
rank    [  93% ] 0010/0300 VUs  28.0s/30s  5000.00 iters/s
top     [  93% ] 0006/0300 VUs  28.0s/30s  5000.00 iters/s
write   [  93% ] 0003/0200 VUs  28.0s/30s  1000.00 iters/s

running (0m29.0s), 0014/0800 VUs, 318483 complete and 0 interrupted iterations
rank    [  97% ] 0007/0300 VUs  29.0s/30s  5000.00 iters/s
top     [  97% ] 0007/0300 VUs  29.0s/30s  5000.00 iters/s
write   [  97% ] 0002/0200 VUs  29.0s/30s  1000.00 iters/s

running (0m30.0s), 0021/0800 VUs, 329482 complete and 0 interrupted iterations
rank    [ 100% ] 0009/0300 VUs  30.0s/30s  5000.00 iters/s
top     [ 100% ] 0010/0300 VUs  30.0s/30s  5000.00 iters/s
write   [ 100% ] 0002/0200 VUs  30.0s/30s  1000.00 iters/s

     ✓ top 200
     ✓ rank 200/404
     ✓ score 200

     checks.............................: 100.00% 329999 out of 329999
     data_received......................: 925 MB  31 MB/s
     data_sent..........................: 42 MB   1.4 MB/s
     http_req_blocked...................: avg=39.9µs  med=1.41µs p(95)=3.91µs  p(99)=15.91µs  max=67.29ms
     http_req_connecting................: avg=36.52µs med=0s     p(95)=0s      p(99)=0s       max=67.14ms
   ✓ http_req_duration..................: avg=3.03ms  med=1.93ms p(95)=8.38ms  p(99)=24.25ms  max=94.68ms
       { expected_response:true }.......: avg=3.03ms  med=1.93ms p(95)=8.38ms  p(99)=24.25ms  max=94.68ms
     ✓ { name:GET /leaderboard/rank }...: avg=2.95ms  med=1.94ms p(95)=8.21ms  p(99)=21.97ms  max=54.62ms
     ✓ { name:GET /leaderboard/top }....: avg=2.84ms  med=1.83ms p(95)=7.94ms  p(99)=21.68ms  max=56.72ms
     ✓ { name:POST /score }.............: avg=4.34ms  med=2.28ms p(95)=12.72ms p(99)=52.66ms  max=94.68ms
   ✓ http_req_failed....................: 0.00%   0 out of 329999
     http_req_receiving.................: avg=22.13µs med=12µs   p(95)=67.37µs p(99)=148µs    max=10.65ms
     http_req_sending...................: avg=13.41µs med=3.2µs  p(95)=44.29µs p(99)=145.75µs max=13.7ms 
     http_req_tls_handshaking...........: avg=0s      med=0s     p(95)=0s      p(99)=0s       max=0s     
     http_req_waiting...................: avg=2.99ms  med=1.9ms  p(95)=8.29ms  p(99)=24.19ms  max=94.65ms
     http_reqs..........................: 329999  10999.252372/s
     iteration_duration.................: avg=3.12ms  med=1.98ms p(95)=8.47ms  p(99)=25.32ms  max=98.68ms
     iterations.........................: 329999  10999.252372/s
     vus................................: 21      min=12               max=89 
     vus_max............................: 800     min=800              max=800


running (0m30.0s), 0000/0800 VUs, 329999 complete and 0 interrupted iterations
rank  ✓ [ 100% ] 0000/0300 VUs  30s  5000.00 iters/s
top   ✓ [ 100% ] 0000/0300 VUs  30s  5000.00 iters/s
write ✓ [ 100% ] 0000/0200 VUs  30s  1000.00 iters/s