k6/results/read-100k.txt
     checks.........................: 100.00% 299870 out of 299870
     dropped_iterations.............: 133     4.432911/s
   ✓ http_req_duration..............: avg=2.11ms  med=1.56ms  p(95)=4.56ms  p(99)=12.57ms  max=56.92ms 
   ✓ http_req_failed................: 0.00%   0 out of 299870
     http_reqs......................: 299870  9994.713532/s
     vus_max........................: 602     min=602              max=602